# Homework 3 (40 pts)


Due Date: 11/12/2020 (Thursday 11:59 AM

Save Notebook file as :HW2_YourStudentID.ipynb

Upload to your Github and email the link to: jzhang@eastwest.edu

Subject: Homework 3 by YourStudentID and your name

In [2]:
%matplotlib inline
import pandas as pd

In [3]:
# limiting the display rows
pd.set_option('display.max_rows', 5)

In [4]:
sales = pd.read_csv('data/MarchSales.csv')
print(sales.shape)
sales

(107, 10)

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
0,2018-001,KRM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,2788
1,2018-002,RKM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,3245
...,...,...,...,...,...,...,...,...,...,...
105,2018-102,MAP,Chantalle,Desmarais,3/31/2018,Bedroom,Mattress,Paid in Full,Promotion,2000
106,2018-103,KRM,Sebastian,Gruenewald,3/31/2018,Living Room,End Tables,Finance,Standard,2505

In [ ]:
(107, 10)
Trans_No	Operator	Sales_First	Sales_Last	Date	Department	Furniture	Pay_Type	Trans_Type	Amount
0	2018-001	KRM	Sebastian	Gruenewald	3/1/2018	Bedroom	Mattress	Finance	Promotion	2788
1	2018-002	RKM	Sebastian	Gruenewald	3/1/2018	Bedroom	Mattress	Finance	Promotion	3245
...	...	...	...	...	...	...	...	...	...	...
105	2018-102	MAP	Chantalle	Desmarais	3/31/2018	Bedroom	Mattress	Paid in Full	Promotion	2000
106	2018-103	KRM	Sebastian	Gruenewald	3/31/2018	Living Room	End Tables	Finance	Standard	2505
107 rows × 10 columns

In [105]:
print('Bir Mahato  & ma21534')

# Problem 1. (2 pt)

# Show the number of rows and columns in sales dataframe.
print(sales.shape)
sales

Bir Mahato  & ma21534
(107, 10)

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
0,2018-001,KRM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,2788
1,2018-002,RKM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,3245
...,...,...,...,...,...,...,...,...,...,...
105,2018-102,MAP,Chantalle,Desmarais,3/31/2018,Bedroom,Mattress,Paid in Full,Promotion,2000
106,2018-103,KRM,Sebastian,Gruenewald,3/31/2018,Living Room,End Tables,Finance,Standard,2505

In [106]:
print('Bir Mahato  & ma21534')

# Problem 2 (2 pt)

# show the column names of the datafram 
names = sales.columns

print(names)
print('----------------------------------------\n')
# show the index of the datafram 
sales.index

Bir Mahato  & ma21534
Index(['Trans_No', 'Operator', 'Sales_First', 'Sales_Last', 'Date',
       'Department', 'Furniture', 'Pay_Type', 'Trans_Type', 'Amount'],
      dtype='object')
----------------------------------------

RangeIndex(start=0, stop=107, step=1)

In [ ]:
Your Name and StudentID

Index(['Trans_No', 'Operator', 'Sales_First', 'Sales_Last', 'Date',
       'Department', 'Furniture', 'Pay_Type', 'Trans_Type', 'Amount'],
      dtype='object')
----------------------------------------

RangeIndex(start=0, stop=107, step=1)

In [107]:
print('Bir Mahato  & ma21534')

# Problem 3 (2 pt)
# Only show Trans number
name = sales['Trans_No']  # this is a series
print(name)

Bir Mahato  & ma21534
0      2018-001
1      2018-002
         ...
105    2018-102
106    2018-103
Name: Trans_No, Length: 107, dtype: object

In [ ]:
Your Name and StudentID
0      2018-001
1      2018-002
         ...   
105    2018-102
106    2018-103
Name: Trans_No, Length: 107, dtype: objec

In [108]:
print('Bir Mahato  & ma21534')

# Problem 4 (4 pt)
# Show Department without duplicate
Department = sales.Department.unique()


print()
# Display department name as following format
print('Department')
print('---------------------------------------------')

for name in Department:
    print(name)

Bir Mahato  & ma21534

Department
---------------------------------------------
Bedroom
Living Room
Appliances
Dining Room

In [ ]:
Your Name and StudentID
['Bedroom' 'Living Room' 'Appliances' 'Dining Room']

Department
---------------------------------------------
Bedroom
Living Room
Appliances
Dining Room

In [109]:
print('Bir Mahato  & ma21534')

# Problem 5 (2 pt)
# Show the columns: Trans_No, Sales Representatives Name.

sales[['Trans_No', 'Sales_First', 'Sales_Last']]

Bir Mahato  & ma21534

     Trans_No Sales_First  Sales_Last
0    2018-001   Sebastian  Gruenewald
1    2018-002   Sebastian  Gruenewald
..        ...         ...         ...
105  2018-102   Chantalle   Desmarais
106  2018-103   Sebastian  Gruenewald

[107 rows x 3 columns]

In [ ]:
Your Name and StudentID
Trans_No	Sales_First	Sales_Last
0	2018-001	Sebastian	Gruenewald
1	2018-002	Sebastian	Gruenewald
...	...	...	...
105	2018-102	Chantalle	Desmarais
106	2018-103	Sebastian	Gruenewald

In [110]:
print('Bir Mahato & ma21534\n')

# Problem 6 (2 pt)
# Show the columns: Trans_No, Sales Representatives Name. 
# (only show the first, third and fifth row)
# HitL use .loc


res = sales[['Trans_No','Sales_First','Sales_Last']].loc[[0, 2, 4]]
print(res)

Bir Mahato & ma21534

   Trans_No Sales_First  Sales_Last
0  2018-001   Sebastian  Gruenewald
2  2018-003        Jade   Gallagher
4  2018-005        Jade   Gallagher

In [ ]:
	Trans_No	Sales_First	Sales_Last
0	2018-001	Sebastian	Gruenewald
2	2018-003	Jade	Gallagher
4	2018-005	Jade	Gallagher

In [111]:
print('Bir Mahato  & ma21534')

# Problem 7 (2 pt)
# Show all transactions in the department of Living Room
sales['Department'] == 'Bedroom'

sales[sales['Department'] == 'Living Room']

Bir Mahato  & ma21534

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
2,2018-003,MAP,Jade,Gallagher,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,10000
3,2018-004,MAP,Jade,Gallagher,3/1/2018,Living Room,End Tables,Finance,Promotion,1000
...,...,...,...,...,...,...,...,...,...,...
98,2018-095,COK,Sebastian,Gruenewald,3/29/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Standard,14275
106,2018-103,KRM,Sebastian,Gruenewald,3/31/2018,Living Room,End Tables,Finance,Standard,2505

In [ ]:
Your Name and StudentID
Trans_No	Operator	Sales_First	Sales_Last	Date	Department	Furniture	Pay_Type	Trans_Type	Amount
2	2018-003	MAP	Jade	Gallagher	3/1/2018	Living Room	Sofa, Loveseat, Chair Package	Finance	Promotion	10000
3	2018-004	MAP	Jade	Gallagher	3/1/2018	Living Room	End Tables	Finance	Promotion	1000
...	...	...	...	...	...	...	...	...	...	...
98	2018-095	COK	Sebastian	Gruenewald	3/29/2018	Living Room	Sofa, Loveseat, Chair Package	Finance	Standard	14275
106	2018-103	KRM	Sebastian	Gruenewald	3/31/2018	Living Room	End Tables	Finance	Standard	2505
26 rows × 10 columns

In [136]:
print('Bir Mahato  & ma21534')

# Problem 8 (2 pts)
# Show all transaction in Living Room Department and Trans_Type is Promotion

res = sales[(sales.Department == 'Living Room') & (sales.Trans_Type == 'Promotion')]
print(res)

print('----------------------)')
#we can also use this
res = sales[(sales['Department'] == 'Living Room') & (sales['Trans_Type'] == 'Promotion')][['Trans_No','Operator','Sales_First','Sales_Last','Date','Department','Furniture','Pay_Type', 'Trans_Type', 'Amount']]
res

Bir Mahato  & ma21534
    Trans_No Operator Sales_First Sales_Last       Date   Department  \
2   2018-003      MAP        Jade  Gallagher   3/1/2018  Living Room
3   2018-004      MAP        Jade  Gallagher   3/1/2018  Living Room
..       ...      ...         ...        ...        ...          ...
73  2018-070      KRM     Ambrose   Sardelis  3/23/2018  Living Room
77  2018-074      MAP        Jade  Gallagher  3/24/2018  Living Room

                        Furniture      Pay_Type Trans_Type  Amount
2   Sofa, Loveseat, Chair Package       Finance  Promotion   10000
3                      End Tables       Finance  Promotion    1000
..                            ...           ...        ...     ...
73  Sofa, Loveseat, Chair Package       Finance  Promotion   12500
77                       Loveseat  Paid in Full  Promotion    1255

[11 rows x 10 columns]
----------------------)

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
2,2018-003,MAP,Jade,Gallagher,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,10000
3,2018-004,MAP,Jade,Gallagher,3/1/2018,Living Room,End Tables,Finance,Promotion,1000
...,...,...,...,...,...,...,...,...,...,...
73,2018-070,KRM,Ambrose,Sardelis,3/23/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,12500
77,2018-074,MAP,Jade,Gallagher,3/24/2018,Living Room,Loveseat,Paid in Full,Promotion,1255

In [132]:
print('Bir Mahato  & ma21534')

# Problem 9 (2 pts)
# Show all transaction which amount is over 1000 or Pay_Type is Finance

res = sales[(sales.Amount > 1000) & (sales.Pay_Type=='Finance')]
print(res)


print('--------------------------------------')
#or we can use 'Trans_No','Operator','Sales_First','Sales_Last','Date',
res = sales[(sales.Amount > 1000) & (sales.Pay_Type=='Finance')][['Trans_No','Operator','Sales_First','Sales_Last','Date','Department','Furniture','Pay_Type', 'Trans_Type', 'Amount']]
res

Bir Mahato  & ma21534
     Trans_No Operator Sales_First  Sales_Last       Date   Department  \
0    2018-001      KRM   Sebastian  Gruenewald   3/1/2018      Bedroom
1    2018-002      RKM   Sebastian  Gruenewald   3/1/2018      Bedroom
..        ...      ...         ...         ...        ...          ...
104  2018-101      KRM   Sebastian  Gruenewald  3/31/2018      Bedroom
106  2018-103      KRM   Sebastian  Gruenewald  3/31/2018  Living Room

                 Furniture Pay_Type Trans_Type  Amount
0                 Mattress  Finance  Promotion    2788
1                 Mattress  Finance  Promotion    3245
..                     ...      ...        ...     ...
104  Bedroom Furniture Set  Finance  Promotion    5773
106             End Tables  Finance   Standard    2505

[64 rows x 10 columns]
-----------------

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
0,2018-001,KRM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,2788
1,2018-002,RKM,Sebastian,Gruenewald,3/1/2018,Bedroom,Mattress,Finance,Promotion,3245
...,...,...,...,...,...,...,...,...,...,...
104,2018-101,KRM,Sebastian,Gruenewald,3/31/2018,Bedroom,Bedroom Furniture Set,Finance,Promotion,5773
106,2018-103,KRM,Sebastian,Gruenewald,3/31/2018,Living Room,End Tables,Finance,Standard,2505

In [ ]:
	Trans_No	Operator	Sales_First	Sales_Last	Date	Department	Furniture	Pay_Type	Trans_Type	Amount
0	2018-001	KRM	Sebastian	Gruenewald	3/1/2018	Bedroom	Mattress	Finance	Promotion	2788
1	2018-002	RKM	Sebastian	Gruenewald	3/1/2018	Bedroom	Mattress	Finance	Promotion	3245
...	...	...	...	...	...	...	...	...	...	...
104	2018-101	KRM	Sebastian	Gruenewald	3/31/2018	Bedroom	Bedroom Furniture Set	Finance	Promotion	5773
106	2018-103	KRM	Sebastian	Gruenewald	3/31/2018	Living Room	End Tables	Finance	Standard	2505

In [114]:
print('Bir Mahato  & ma21534')

# Problem 10 (2 pts)
# Show all transaction which amount is over 10000
# Only include columns: Trans_No, Furniture,Pay_Type, Amount
sales[sales['Amount']>10000][['Trans_No', 'Furniture', 'Pay_Type', 'Amount']]

Bir Mahato  & ma21534

     Trans_No                      Furniture Pay_Type  Amount
5    2018-006  Sofa, Loveseat, Chair Package  Finance   12000
6    2018-006  Sofa, Loveseat, Chair Package  Finance   12000
..        ...                            ...      ...     ...
100  2018-097          Bedroom Furniture Set  Finance   14321
103  2018-100          Bedroom Furniture Set  Finance   11234

[11 rows x 4 columns]

In [ ]:
Your Name and StudentID
Out[33]:
Trans_No	Furniture	Pay_Type	Amount
5	2018-006	Sofa, Loveseat, Chair Package	Finance	12000
6	2018-006	Sofa, Loveseat, Chair Package	Finance	12000
...	...	...	...	...
100	2018-097	Bedroom Furniture Set	Finance	14321
103	2018-100	Bedroom Furniture Set	Finance	11234
11 rows × 4 columns

In [115]:
print('Bir Mahato  & ma21534')

# Problem 11 ( 2 pt)
# Show the all transactions by Ambrose Sardelis

res = sales[(sales.Sales_First == 'Ambrose') & (sales.Sales_Last =='Sardelis')]
res

Bir Mahato  & ma21534

,Trans_No,Operator,Sales_First,Sales_Last,Date,Department,Furniture,Pay_Type,Trans_Type,Amount
5,2018-006,COK,Ambrose,Sardelis,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,12000
6,2018-006,COK,Ambrose,Sardelis,3/1/2018,Living Room,"Sofa, Loveseat, Chair Package",Finance,Promotion,12000
...,...,...,...,...,...,...,...,...,...,...
96,2018-093,MAP,Ambrose,Sardelis,3/28/2018,Bedroom,Mattress,Paid in Full,Standard,2000
97,2018-094,MAP,Ambrose,Sardelis,3/28/2018,Bedroom,Mattress,Paid in Full,Promotion,3245

In [ ]:
	Trans_No	Operator	Sales_First	Sales_Last	Date	Department	Furniture	Pay_Type	Trans_Type	Amount
5	2018-006	COK	Ambrose	Sardelis	3/1/2018	Living Room	Sofa, Loveseat, Chair Package	Finance	Promotion	12000
6	2018-006	COK	Ambrose	Sardelis	3/1/2018	Living Room	Sofa, Loveseat, Chair Package	Finance	Promotion	12000
...	...	...	...	...	...	...	...	...	...	...
96	2018-093	MAP	Ambrose	Sardelis	3/28/2018	Bedroom	Mattress	Paid in Full	Standard	2000
97	2018-094	MAP	Ambrose	Sardelis	3/28/2018	Bedroom	Mattress	Paid in Full	Promotion	3245
24 rows × 10 columns

In [116]:
print('Bir Mahato  & ma21534')

# Problem 12 ( 2 pt)
 
# Show the number of transactions by Ambrose Sardelis

tran = len(sales[sales.Sales_First=='Ambrose'])
print('Total Number of transactions by Ambrose Sardelis is ',tran )

Bir Mahato  & ma21534
Total Number of transactions by Ambrose Sardelis is  24

In [ ]:
Your Name and StudentID
Number of transactions by Ambrose Sardelis:24

In [118]:
print('Bir Mahato  & ma21534')

# Problem 13 ( 2 pt)
 
# Show the total sales by Ambrose Sardelis
res = sales[(sales.Sales_First == 'Ambrose') & (sales.Sales_Last =='Sardelis')]['Amount'].sum()
print('Total sale by Ambrose Sardelis is $ ', res)

Bir Mahato  & ma21534
Total sale by Ambrose Sardelis is $  131899

In [ ]:
Your Name and StudentID
Total sales of transactions by Ambrose Sardelis $ 131899

In [117]:
print('Bir Mahato  & ma21534')

# Problem 14 (2 pt)
# Show the total sales amount in March.
res = sales['Amount'].sum()
print('Total sales of March: $ ', res)

Bir Mahato  & ma21534
Total sales of March: $  493887

In [ ]:
Your Name and StudentID
Total Sales: $ 493887

In [119]:
print('Bir Mahato  & ma21534')

# Problem 15 & 16 ( 4 pts)
# What the percentage of sales transactions in Promotion type among all sales transaction.

total_tran = len(sales['Trans_Type'])
print('Total Number of transactions : ',total_tran )

prom_tran = len(sales[sales.Trans_Type == 'Promotion'])
print('Total Promotion transactions : ',prom_tran )

print('Percentage of sales transaction ', format((prom_tran/total_tran), '.2%'))

Bir Mahato  & ma21534
Total Number of transactions :  107
Total Promotion transactions :  52
Percentage of sales transaction  48.60%

In [ ]:
Your Name and StudentID

Total transaction number: 107
Number of sales transactions in Promotion: 52
percentage of sales transactions  48.60%

In [120]:
print('Bir Mahato  & ma21534')

# Problem 16 & 17 ( 4 pts)
# What the percentage of total sales from living room department among total sales.
tot_sale = sales['Amount'].sum()
print('Total sales of March: $ ', tot_sale)

living_room_sales = sales[(sales.Department == 'Living Room')]['Amount'].sum()
print('Total sales of Living room: $ ', living_room_sales)

print('Percentage of total sales is ', format((living_room_sales/tot_sale), '.2%'))

Bir Mahato  & ma21534
Total sales of March: $  493887
Total sales of Living room: $  155323
Percentage of total sales is  31.45%

In [ ]:
March total sales : $ 493887
Living room department total sales : $ 155323
The percentage of total sales 31.45%

In [121]:
print('Bir Mahato  & ma21534')

# Problem 18 ( 2 pt)
# Show sales Amount from Bedroom and living room department. ( hint: Use OR Logic)
#or  [(sales.Department =='Living Room')]]

total_sale_amount = sales[(sales['Department'] =='Bedroom') | (sales['Department'] =='Living Room') ].Amount.sum()
print('Total sales of Bedroom and Living room: $ ', total_sale_amount)

Bir Mahato  & ma21534
Total sales of Bedroom and Living room: $  282018

In [ ]:
YourStudentID
Total Sales by Bedroom and living room department: $ 282018

In [122]:
print('Bir Mahato  & ma21534')

# Problem 19 ( 2 pt)
# Show the number of sales transactions from Bedroom department and Living Room department.
#  ( hint: Use OR Logic)

total_trans = len(sales[(sales['Department'] =='Bedroom') | (sales['Department'] =='Living Room') ])
print('Total transactions from Bedroom and Living Room Department is ',total_trans )

Bir Mahato  & ma21534
Total transactions from Bedroom and Living Room Department is  50